emacs/setup/src/package.org
#+title: package
#+options: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil toc:nil
#+options: html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../style.css"/>

#+BEGIN_SRC elisp  
  (package-initialize)
  
  (setq package-list '(dired+ bookmark+ yasnippet csv-mode))
  (setq package-list '(htmlize ox-twbs vimish-fold))
  (setq package-list '(ace-jump-mode))

  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "http://melpa.org/packages/") t)

  (add-to-list 'package-archives
               '("org" . "http://orgmode.org/elpa/"))

  ;; fetch the list of packages available
  (unless package-archive-contents
    (package-refresh-contents))

  ;; install the missing packages
  (dolist (package package-list)
    (unless (package-installed-p package)
      (package-install package)))

  ;; upgrade installed packages
  ;; U  package-menu-mark-upgrades
  ;; x  package-menu-execute
#+END_SRC

[[../setup.html][back]]
