emacs/setup/package.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>package</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">package</h1>
<div class="org-src-container">
<pre class="src src-elisp">(package-initialize)

(<span class="org-keyword">setq</span> package-list '(dired+ bookmark+ yasnippet csv-mode))
(<span class="org-keyword">setq</span> package-list '(htmlize ox-twbs vimish-fold))
(<span class="org-keyword">setq</span> package-list '(ace-jump-mode))

(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(add-to-list 'package-archives
             '(<span class="org-string">"melpa"</span> . <span class="org-string">"http://melpa.org/packages/"</span>) t)

(add-to-list 'package-archives
             '(<span class="org-string">"org"</span> . <span class="org-string">"http://orgmode.org/elpa/"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">fetch the list of packages available</span>
(<span class="org-keyword">unless</span> package-archive-contents
  (package-refresh-contents))

<span class="org-comment-delimiter">;; </span><span class="org-comment">install the missing packages</span>
(<span class="org-keyword">dolist</span> (package package-list)
  (<span class="org-keyword">unless</span> (package-installed-p package)
    (package-install package)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">upgrade installed packages</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">U  package-menu-mark-upgrades</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">x  package-menu-execute</span>
</pre>
</div>

<p>
<a href="../setup.html">back</a>
</p>
</div>
</body>
</html>
